# ForwardIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementSet..::..ForwardIterator Method
ElementSet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ElementSetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As ElementSetIterator
```

Visual C++
---
```text
public:
virtual ElementSetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
ElementSet Class
Autodesk.Revit.DB Namespace